In [83]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,Californi,51755,55319,55734,57014,56134,54283,53367,57020,57528

#### Average income of Alaska in all years?

In [5]:
sum=0
count=0
for i in range(2,11):
    sum+=income.values[2][i]
    count+=1
    avg=sum/count
print(avg)

47214.77777777778

In [3]:
424933/9

47214.77777777778

#### Average income of all states in 2012

In [78]:
su=0
count=0
for i in income.values:
    s=i[9]
    su+=s
    count+=1
    avg=su/count
print(avg)

50038.8

#### Create a function to print all columns in a single line

In [16]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [19]:
def column():
    print(income.columns.tolist())
    return 
column()

['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013']

#### Create a function to access a row based on a unique column value

In [89]:
def access(num):
   return income.values[num]
n=int(input())
print(access(n))

2
['04000US04' 'Arizona' 45245 46657 47215 46914 45739 46896 48621 47044
 50602]

#### Create a function to find average income of all states from 2005 to 2013

In [72]:
def average():
    su=0
    count=0
    for i in income.values:
        s=(i[2],i[3],i[4],i[5],i[6],i[7],i[8],i[9],i[10])
        for j in s:
            su=su+j
            count+=1
            avg=su/count
    return avg
print(average())

48525.42222222222

#### Create a function to find the highest average income in the last three years

In [65]:
def highAvg():
    s=income.columns[-3:]
    hig=income[s[0]].mean()
    for i in s:
        x=income[i].mean()
        if x>hig:
            hig=x
    print(hig)
highAvg()

50113.4

#### Create a function to find the lowest average income from 2007 t0 2010(inclusive)

In [76]:
def lowestAvg():
    s=income.columns[4:8]
    low=income[s[0]].mean()
    for i in s:
        x=income[i].mean()
        if x<low:
            low=x
    print(low)
lowestAvg()

Index(['2007', '2008', '2009', '2010'], dtype='object')
47709.4

#### Print the list of all states in the same line with average income less than californi

In [84]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,Californi,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [82]:
c=income.values[-1][2:].mean()
for i in range(len(income)):
   if c>income.values[i][2:].mean():
       print(income.values[i][1],'\t',income.values[i][2:].mean())

Alabama 	 41126.444444444445
Arizona 	 47214.77777777778
Arkansas 	 38828.88888888889

#### print the names of states based on descending order of their averages

In [102]:
def desc():
    s=income.values[0][2:]
    low=income[s[0]].mean()
    for i in s:
        x=income[i].mean()
        if x<low:
            low=x
    print(low)
desc()

#### state the lowest recorded income from 2005 to 2013

In [95]:
s=income.columns[2:]
low=income[s[0]].min()
for i in s:
    x=income[i].min()
    if x<low:
        low=x
print(low)

36538

In [100]:
income.values[0][2:].mean()

41126.444444444445